In [1]:
#pandas tutorial 

## pandas is an open source, BSD licensed library providing high-performance, easy-to-use data structures and data analysis tools for the python programing language.

### agenda 

 ## what is DataFrames?
 ## what is DataSeries ?
 ## different operations in pandas.

In [2]:
##first step is to import pandas
import pandas as pd
import numpy as np

In [4]:
## playing with dataframes

df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['row1' , 'row2' , 'row3' , 'row4' , 'row5'],columns=['column1' , 'column2' , 'column3' , 'column4'])

In [5]:
df.head()

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [6]:
## to make it to comma seprated value 

df.to_csv('test1.csv')

In [7]:
## accessing the elements
## 1.loc 2.iloc.
df.loc['row1']

column1    0
column2    1
column3    2
column4    3
Name: row1, dtype: int32

In [8]:
type(df.loc['row1'])

pandas.core.series.Series

In [9]:
## if we atleast more than one column it will be a data frame less than that is will be a series.

In [10]:
df.iloc[0:3,0:2]

      column1  column2
row1        0        1
row2        4        5
row3        8        9

In [11]:
type(df.iloc[0:3,0:2])

pandas.core.frame.DataFrame

In [12]:
df.iloc[0:3,0:1]

      column1
row1        0
row2        4
row3        8

In [14]:
type(df.iloc[0:3,0])

pandas.core.series.Series

In [15]:
# to convert data frames into arrays

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [16]:
type(df.iloc[:,1:].values)

numpy.ndarray

In [17]:
df.iloc[:,1:].values.shape

(5, 3)

In [18]:
## checking the null values

df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [19]:
df

      column1  column2  column3  column4
row1        0        1        2        3
row2        4        5        6        7
row3        8        9       10       11
row4       12       13       14       15
row5       16       17       18       19

In [20]:
df['column2'].value_counts()

column2
1     1
5     1
9     1
13    1
17    1
Name: count, dtype: int64

In [24]:
df['column2'].value_counts()

column2
1     1
5     1
9     1
13    1
17    1
Name: count, dtype: int64

In [25]:
df['column2'].unique()

array([ 1,  5,  9, 13, 17])

In [5]:
#putting this on pouse because we cannot find the mercedes csv file.
df=pd.read_csv('mercedesbenz.csv')

In [7]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0